#!/usr/bin/env bash

# 以下代码展示出$@和$*的区别。
# 执行./$0 1 2 3 时
# 当不加引号""时，2者没有区别，都代表3个变量。
# 当添加引号时，"$*"代表一个变量，其值为3个
# 以下代码输出结果如下：
#1 2 3
#1 2 3
#1 2 3
#1 2 3
#------------------------------
#1
#2
#3
#------------------------------
#1
#2
#3
#------------------------------
#1
#2
#3
#------------------------------
#1 2 3
#------------------------------

echo $@
echo $*
echo "$@"
echo "$*"
echo "------------------------------"

# 以下2段代码输出结果一致
for var in $@; do
    echo ${var}
done
echo "------------------------------"

for var in $*; do
    echo ${var}
done
echo "------------------------------"


# 以下2段代码输出结果不一致
for var in "$@"; do
    echo ${var}
done
echo "------------------------------"

for var in "$*"; do
    echo ${var}
done
echo "------------------------------"

